rushikesh81005-dev/autonomous-AI-powered-drone-for-SAR-mission-project-SAR-/SAR_Drone_ESP32_FULL_FEATURE_BENCH_SAFE.ino
/*
 * SAR Drone - ESP32 Dev Module (38 pin), direct Quad-X controller
 * --------------------------------------------------------------------------
 * Target hardware:
 *   - Classic ESP32 Dev Module, 38 pin
 *   - MPU6050 on I2C (GPIO 21/22)
 *   - GPS on UART2 (GPIO 16/17)
 *   - OV7670-style 8-bit parallel grayscale camera
 *   - Four standard PWM ESCs (assumed 1000-2000 us, 50 Hz)
 *
 * IMPORTANT SAFETY LIMITS
 *   1. BENCH_TEST_MODE is deliberately true. In this mode every physical ESC
 *      output stays at ESC_MIN_US even though the controller computes a mix.
 *   2. Remove all propellers for calibration, motor-order and sign testing.
 *   3. An MPU6050 + GPS cannot provide dependable altitude hold. There is no
 *      autonomous takeoff/landing in this build. THR is an operator-set,
 *      open-loop throttle and must never be treated as altitude control.
 *   4. There is no absolute heading sensor. Yaw drifts while hovering. GPS
 *      course can correct yaw only while the aircraft is already moving.
 *   5. Camera analysis reports a VISUAL CANDIDATE, not a verified human.
 *
 * This sketch is a bench-development controller. It is not certified or
 * field-ready rescue-aircraft software.
 * Revision: 1.1 - second critical review, 2026-09-04
 */

#include <Arduino.h>
#include <Wire.h>
#include <WiFi.h>
#include <WiFiUdp.h>
#include <ArduinoOTA.h>
#include "esp_camera.h"
#include <math.h>
#include <ctype.h>
#include <string.h>
#include <Adafruit_BMP280.h>
#include <Adafruit_MLX90640.h>

// ============================ TinyML / FOMO ================================
// The inference adapter uses an Edge Impulse-exported FOMO model. The model
// itself is NOT fabricated here: a trained .eim/TFLite model must be exported
// from your own SAR/person dataset and the generated Edge Impulse Arduino
// library placed beside this sketch. The controller still compiles without it
// and falls back to the legacy visual candidate detector.
#ifndef ENABLE_FOMO_TINYML
#define ENABLE_FOMO_TINYML 1
#endif
#ifndef FOMO_MIN_CONFIDENCE
#define FOMO_MIN_CONFIDENCE 0.65f
#endif
#ifndef FOMO_INPUT_WIDTH
#define FOMO_INPUT_WIDTH 96
#endif
#ifndef FOMO_INPUT_HEIGHT
#define FOMO_INPUT_HEIGHT 96
#endif

#if ENABLE_FOMO_TINYML && __has_include("edge-impulse-sdk/classifier/ei_run_classifier.h")
  #include "edge-impulse-sdk/classifier/ei_run_classifier.h"
  #define FOMO_LIBRARY_PRESENT 1
#else
  #define FOMO_LIBRARY_PRESENT 0
#endif


#if __has_include(<esp_arduino_version.h>)
#include <esp_arduino_version.h>
#endif

// ============================= BUILD SAFETY ================================

static constexpr bool BENCH_TEST_MODE          = true;
static constexpr bool ENABLE_CAMERA            = true;
static constexpr bool ENABLE_GESTURE_COMMANDS  = true;
static constexpr bool ENABLE_VIBRATION_RTH     = true;
static constexpr bool ENABLE_WIFI_OTA          = true;
static constexpr bool ENABLE_UDP_TELEMETRY     = true;
static constexpr bool ENABLE_BATTERY_MONITOR   = true;
static constexpr bool ENABLE_VOICE_UART        = false;



// The classic 38-pin board has no spare ADC1 pin with this parallel camera.
// Battery monitoring therefore remains disabled until an external I2C ADC
// (recommended) or a revised, electrically validated pin map is installed.

// =============================== PIN MAP ====================================

static constexpr uint8_t MPU_ADDR          = 0x68;
static constexpr int I2C_SDA_PIN           = 21;
static constexpr int I2C_SCL_PIN           = 22;
static constexpr int GPS_RX_PIN            = 16;
static constexpr int GPS_TX_PIN            = 17;
static constexpr int MISSION_SWITCH_PIN    = 23; // LOW permits arming

/* Quad-X motor order, viewed from above:
 *          FRONT
 *     M1 (CCW)   M2 (CW)
 *     M4 (CW)    M3 (CCW)
 */
static constexpr int MOTOR_1_PIN = 25; // front-left
static constexpr int MOTOR_2_PIN = 26; // front-right
static constexpr int MOTOR_3_PIN = 27; // rear-right
static constexpr int MOTOR_4_PIN = 19; // rear-left

// Camera pin map from the supplied sketch.
static constexpr int CAM_D0    = 34;
static constexpr int CAM_D1    = 35;
static constexpr int CAM_D2    = 36;
static constexpr int CAM_D3    = 39;
static constexpr int CAM_D4    = 32;
static constexpr int CAM_D5    = 33;
static constexpr int CAM_D6    = 14;
static constexpr int CAM_D7    = 13;
static constexpr int CAM_XCLK  = 4;
static constexpr int CAM_PCLK  = 18;
static constexpr int CAM_VSYNC = 5;
static constexpr int CAM_HREF  = 15;

// GPIO 4 cannot simultaneously be camera XCLK and voice UART RX. Voice UART
// is therefore disabled for this exact board/pin map. Commands remain
// available over USB Serial and may later be forwarded by a voice base station.

// ============================= ESC / CONTROL ================================

static constexpr uint16_t ESC_MIN_US       = 1000;
static constexpr uint16_t ESC_IDLE_US      = 1060;
static constexpr uint16_t ESC_MAX_US       = 1900;
static constexpr uint16_t THROTTLE_MAX_US  = 1750; // deliberate first-stage cap
static constexpr uint16_t ESC_PWM_HZ       = 50;
static constexpr uint8_t  ESC_PWM_BITS     = 16;
static constexpr uint8_t  MOTOR_CHANNEL[4] = {4, 5, 6, 7}; // avoids camera ch 0

// Sensor orientation assumption: MPU X points forward, Y right, Z upward.
// Change only after a propeller-off axis test. The signs must make the displayed
// angle/rate increase in the documented direction.
static constexpr float ACCEL_X_SIGN =  1.0f;
static constexpr float ACCEL_Y_SIGN =  1.0f;
static constexpr float ACCEL_Z_SIGN =  1.0f;
static constexpr float GYRO_X_SIGN  =  1.0f;
static constexpr float GYRO_Y_SIGN  =  1.0f;
static constexpr float GYRO_Z_SIGN  = -1.0f; // yaw positive clockwise for GPS

static constexpr uint32_t CONTROL_PERIOD_US = 4000; // 250 Hz
static constexpr float CONTROL_DT           = 0.004f;
static constexpr float COMPLEMENTARY_ALPHA  = 0.985f;
static constexpr float MAX_TILT_DEG          = 55.0f;
static constexpr float EMERGENCY_TILT_DEG    = 75.0f;
static constexpr float MAX_ANGLE_RATE_DPS    = 180.0f;

// Open-loop navigation values. These do NOT create altitude hold.
static constexpr float NAV_FORWARD_PITCH_DEG = -6.0f;
static constexpr float NAV_MAX_ROLL_DEG      = 8.0f;
static constexpr float WAYPOINT_RADIUS_M     = 8.0f;
static constexpr float GPS_COURSE_MIN_MPS    = 1.5f;
static constexpr uint32_t GPS_TIMEOUT_MS      = 2500;

