rushikesh81005-dev/autonomous-AI-powered-drone-for-SAR-mission-project-SAR-/SAR_Drone_ESP32_FULL_FEATURE_BENCH_SAFE.ino
// ============================== NETWORK =====================================
/*static const char *WIFI_SSID     = "Your-PC-Hotspot-Name";
static const char *WIFI_PASSWORD = "Your-PC-Hotspot-Password";
static const char *OTA_PASSWORD  = "Choose-a-strong-OTA-password";
static constexpr bool ENABLE_WIFI_OTA = true;*/


static const char *WIFI_SSID       = "DRONE_BASE_STATION";
static const char *WIFI_PASSWORD   = "CHANGE_THIS_WIFI_PASSWORD";
static const char *OTA_PASSWORD    = "CHANGE_THIS_OTA_PASSWORD";
static const IPAddress BASE_IP(192, 168, 4, 2);
static constexpr uint16_t TELEMETRY_PORT = 14560;

WiFiUDP telemetryUdp;
volatile bool otaServiceReady = false;
volatile bool udpServiceReady = false;

// =============================== TYPES ======================================

enum class MissionState : uint8_t {
  DISARMED,
  STABILIZE,
  FLY_TO_WAYPOINT,
  RETURN_HOME,
  OBSTACLE_BRAKE,
  SURVEY_GRID,
  GPS_FAILSAFE_HOLD,
  EMERGENCY_STOP,
  LANDING
};

struct GPSData {
  double lat = 0.0;
  double lng = 0.0;
  float speedMps = 0.0f;
  float courseDeg = 0.0f;
  uint8_t satellites = 0;
  bool fix = false;
  bool courseValid = false;
  uint32_t lastFixMs = 0;
};

struct AttitudeData {
  float rollDeg = 0.0f;
  float pitchDeg = 0.0f;
  float yawDeg = 0.0f;
  float gxDps = 0.0f;
  float gyDps = 0.0f;
  float gzDps = 0.0f;
};

struct PID {
  float kp;
  float ki;
  float kd;
  float integral;
  float previousMeasurement;
  float outputLimit;

  float update(float setpoint, float measurement, float dt) {
    const float error = setpoint - measurement;
    integral += error * dt;
    if (ki > 0.00001f) {
      const float iLimit = outputLimit / ki;
      integral = constrain(integral, -iLimit, iLimit);
    }
    // Derivative on measurement avoids a large kick when setpoint changes.
    const float derivative = -(measurement - previousMeasurement) / dt;
    previousMeasurement = measurement;
    return constrain(kp * error + ki * integral + kd * derivative,
                     -outputLimit, outputLimit);
  }

  void reset(float measurement = 0.0f) {
    integral = 0.0f;
    previousMeasurement = measurement;
  }
};

struct SurveyPlan {
  bool valid = false;
  double originLat = 0.0;
  double originLng = 0.0;
  float sideKm = 0.0f;
  float spacingKm = 0.0f;
  uint16_t pointsPerLine = 0;
  uint16_t lineCount = 0;
  uint32_t waypointIndex = 0;
  uint32_t waypointCount = 0;
};

// ============================= SHARED STATE =================================

portMUX_TYPE stateMux = portMUX_INITIALIZER_UNLOCKED;

volatile MissionState mission = MissionState::DISARMED;
volatile bool motorsArmed = false;
volatile bool imuHealthy = false;
volatile bool imuCalibrated = false;
volatile bool cameraHealthy = false;
volatile bool fomoHealthy = false;
volatile bool fomoPersonCandidate = false;
volatile float fomoConfidence = 0.0f;
volatile float fomoCenterX = 0.5f;
volatile float fomoCenterY = 0.5f;
volatile uint32_t fomoInferenceMs = 0;
volatile uint32_t fomoInferenceCount = 0;
static camera_fb_t *fomoFrameForInference = nullptr;
volatile bool obstacleBrakeRequested = false;
volatile bool visualCandidateConfirmed = false;
volatile bool vibrationAlert = false;
volatile float vibrationRmsG = 0.0f;
volatile bool calibrationRequested = false;
volatile bool yawResetRequested = false;
volatile float requestedYawDeg = 0.0f;

GPSData gps;
AttitudeData attitude;
SurveyPlan survey;

double homeLat = 0.0;
double homeLng = 0.0;
volatile bool homeLocked = false;
double targetLat = 0.0;
double targetLng = 0.0;
volatile bool targetValid = false;
volatile bool headingReferenceSet = false;

float gyroBiasX = 0.0f;
float gyroBiasY = 0.0f;
float gyroBiasZ = 0.0f;
float commandedThrottleUs = ESC_MIN_US;
float desiredRollDeg = 0.0f;
float desiredPitchDeg = 0.0f;
float desiredYawRateDps = 0.0f;
uint16_t computedMotorUs[4] = {ESC_MIN_US, ESC_MIN_US, ESC_MIN_US, ESC_MIN_US};

// Angle outer-loop proportional gains: angle error -> desired angular rate.
float rollAngleKp  = 4.0f;
float pitchAngleKp = 4.0f;

// Conservative STARTING values only. Every airframe requires tuning.
PID rollRatePID  = {1.20f, 0.35f, 0.018f, 0, 0, 260};
PID pitchRatePID = {1.20f, 0.35f, 0.018f, 0, 0, 260};
PID yawRatePID   = {1.00f, 0.20f, 0.000f, 0, 0, 160};

TaskHandle_t flightTaskHandle = nullptr;
TaskHandle_t cameraTaskHandle = nullptr;
TaskHandle_t serviceTaskHandle = nullptr;

// ======================== FULL SAR FEATURE MODULE ==========================
// Bench-safe integration. Physical ESC output remains hard-locked by
// BENCH_TEST_MODE. These modules implement sensing, logging, alerting,
// navigation state and analysis without providing a bypass for the lock.

static constexpr int SIM800_RX_PIN = 12; // ESP32 RX <- SIM800 TX
static constexpr int SIM800_TX_PIN = 2;  // ESP32 TX -> SIM800 RX (boot strap: validate hardware)
static constexpr uint32_t SIM800_BAUD = 9600;
static constexpr char RESCUE_PHONE[] = "+910000000000"; // replace before use
static constexpr uint8_t SMS_QUEUE_SIZE = 8;
static constexpr uint16_t EVIDENCE_MAX = 64;
static constexpr uint16_t POLYGON_MAX = 256;
static constexpr uint32_t GPS_STALE_MS = 2500;
static constexpr uint32_t BATTERY_SAMPLE_MS = 500;
static constexpr uint32_t BARO_SAMPLE_MS = 100;
static constexpr uint32_t THERMAL_SAMPLE_MS = 500;
static constexpr float LOW_BATTERY_V = 10.8f;
static constexpr float CRITICAL_BATTERY_V = 10.2f;
static constexpr float BATTERY_DIVIDER_SCALE = 1.0f; // INA219 reports bus V directly
static constexpr float LANDING_STEP_US = 1.0f;
static constexpr float LANDING_MIN_THR_US = 1000.0f;
static constexpr float THERMAL_HOT_DELTA_C = 8.0f;
static constexpr uint16_t THERMAL_MIN_HOT_PIXELS_FULL = 6;
static constexpr uint32_t MULTIFRAME_WINDOW_MS = 2500;
static constexpr uint8_t MULTIFRAME_REQUIRED = 3;
static constexpr float DUPLICATE_RADIUS_M = 12.0f;
static constexpr uint32_t DUPLICATE_WINDOW_MS = 120000;
static constexpr float CAMERA_HFOV_DEG = 60.0f;
static constexpr float CAMERA_VFOV_DEG = 45.0f;

// Forward declarations used by the feature module.
double distanceMeters(double lat1, double lon1, double lat2, double lon2);
void disarmMotors(const char *reason);
void queueRescueAlert(double lat,double lng,float temp);
bool enqueueSMS(const char *msg);
Adafruit_BMP280 fullBmp;
Adafruit_MLX90640 fullMlx;
HardwareSerial sim800(1);

volatile bool fullBmpHealthy=false, fullThermalHealthy=false, batteryHealthy=false;
volatile bool lowBattery=false, criticalBattery=false;
volatile float relativeAltitudeM=0, verticalRateMps=0, batteryVoltage=0, batteryCurrentA=0;
volatile float thermalMaxC=-100, thermalAverageC=-100;
volatile uint16_t thermalHotPixels=0;
volatile bool thermalHotspot=false;
volatile bool multimodalConfirmed=false;
volatile bool duplicateSuppressed=false;
volatile bool gpsLostFailsafe=false;
volatile bool landingRequested=false;

struct EvidenceRecord {
  uint32_t id=0, timeMs=0;
  double droneLat=0, droneLng=0;
  double estimatedLat=0, estimatedLng=0;
  float altitudeM=0, rollDeg=0, pitchDeg=0, yawDeg=0;
  float pixelX=0, pixelY=0, temperatureC=0;
  bool visible=false, thermal=false, confirmed=false, duplicate=false;
};
EvidenceRecord evidence[EVIDENCE_MAX];
uint16_t evidenceCount=0;
uint32_t evidenceNextId=1;

