rushikesh81005-dev/autonomous-AI-powered-drone-for-SAR-mission-project-SAR-/SAR_Drone_ESP32_FULL_FEATURE_BENCH_SAFE.ino
struct GeoPoint { double lat=0, lng=0; uint32_t timeMs=0; };
GeoPoint polygonLog[POLYGON_MAX];
uint16_t polygonCount=0;


struct SmsItem { char text[300]; uint8_t retries=0; uint32_t nextTry=0; bool used=false; };
SmsItem smsQueue[SMS_QUEUE_SIZE];
uint8_t smsHead=0, smsTail=0;

struct DetectionTrack { bool active=false; double lat=0,lng=0; uint32_t lastMs=0; uint8_t confirmations=0; };
DetectionTrack detectionTrack;

float baroGroundPressurePa=0;
uint32_t lastBaroMs=0,lastThermalMs=0,lastBatteryMs=0,lastGpsStateMs=0,lastSmsServiceMs=0;
uint8_t gpsLossConsecutive=0;
PID altitudePID={35.0f,2.0f,8.0f,0,0,120};
float desiredAltitudeM=2.0f;
float altitudePidOutputUs=0.0f;
uint32_t lastPolygonAutoMs=0;
bool lowBatteryAlertSent=false, criticalBatteryAlertSent=false;

bool fullI2CWrite8(uint8_t addr,uint8_t reg,uint8_t value){ Wire.beginTransmission(addr); Wire.write(reg); Wire.write(value); return Wire.endTransmission()==0; }
uint16_t readINA219BusRaw(){
  const uint8_t addr=0x40; Wire.beginTransmission(addr); Wire.write(0x02);
  if(Wire.endTransmission(false)!=0 || Wire.requestFrom((int)addr,2,true)!=2) return 0;
  return ((uint16_t)Wire.read()<<8)|Wire.read();
}
void initFullSensors(){
  fullBmpHealthy = fullBmp.begin(0x76,&Wire) || fullBmp.begin(0x77,&Wire);
  if(fullBmpHealthy){ fullBmp.setSampling(Adafruit_BMP280::MODE_NORMAL,Adafruit_BMP280::SAMPLING_X2,Adafruit_BMP280::SAMPLING_X16,Adafruit_BMP280::FILTER_X16,Adafruit_BMP280::STANDBY_MS_63); baroGroundPressurePa=fullBmp.readPressure(); }
  fullThermalHealthy = (fullMlx.begin(0x33,&Wire)==0);
  if(fullThermalHealthy){ fullMlx.setMode(MLX90640_CHESS); fullMlx.setResolution(MLX90640_ADC_18BIT); fullMlx.setRefreshRate(MLX90640_2_HZ); }
  // INA219 is probed by reading the bus-voltage register. A zero reading means absent.
  const uint16_t raw=readINA219BusRaw(); batteryHealthy=(raw!=0);
  sim800.begin(SIM800_BAUD,SERIAL_8N1,SIM800_RX_PIN,SIM800_TX_PIN);
}

void updateFullBarometer(){
  if(!fullBmpHealthy || millis()-lastBaroMs<BARO_SAMPLE_MS) return; lastBaroMs=millis();
  const float p=fullBmp.readPressure(); if(p<1000 || baroGroundPressurePa<1000) return;
  const float alt=44330.0f*(1.0f-powf(p/baroGroundPressurePa,0.19029495f));
  static float prev=0; static bool have=false; if(have) verticalRateMps=(alt-prev)/(BARO_SAMPLE_MS/1000.0f); prev=alt; have=true; relativeAltitudeM=0.85f*relativeAltitudeM+0.15f*alt;
}
void updateFullThermal(){
  if(!fullThermalHealthy || millis()-lastThermalMs<THERMAL_SAMPLE_MS) return; lastThermalMs=millis();
  float frame[32*24]; if(fullMlx.getFrame(frame)!=0) return;
  float sum=0,mx=-100; uint16_t hot=0; for(float t:frame){sum+=t; if(t>mx)mx=t;} const float avg=sum/768.0f; for(float t:frame) if(t>=avg+THERMAL_HOT_DELTA_C) hot++;
  thermalAverageC=avg; thermalMaxC=mx; thermalHotPixels=hot; thermalHotspot=(hot>=THERMAL_MIN_HOT_PIXELS_FULL);
}
void updateFullBattery(){
  if(millis()-lastBatteryMs<BATTERY_SAMPLE_MS) return; lastBatteryMs=millis();
  const uint16_t raw=readINA219BusRaw(); if(raw==0){batteryHealthy=false;return;} batteryHealthy=true; batteryVoltage=(raw>>3)*0.004f*BATTERY_DIVIDER_SCALE;
  lowBattery=batteryVoltage>0 && batteryVoltage<=LOW_BATTERY_V; criticalBattery=batteryVoltage>0 && batteryVoltage<=CRITICAL_BATTERY_V;
  if(lowBattery && !lowBatteryAlertSent){ char m[220]; snprintf(m,sizeof(m),"SAR LOW BATTERY %.2fV",batteryVoltage); enqueueSMS(m); lowBatteryAlertSent=true; Serial.println(m); }
  if(!lowBattery) lowBatteryAlertSent=false;
  if(criticalBattery && !criticalBatteryAlertSent){ char m[220]; snprintf(m,sizeof(m),"SAR CRITICAL BATTERY %.2fV EMERGENCY",batteryVoltage); enqueueSMS(m); criticalBatteryAlertSent=true; Serial.println(m); }
  if(!criticalBattery) criticalBatteryAlertSent=false;
}

void addPolygonPoint(double lat,double lng){ if(polygonCount<POLYGON_MAX) polygonLog[polygonCount++]={lat,lng,millis()}; }
double polygonAreaM2(){ if(polygonCount<3)return 0; double lat0=polygonLog[0].lat*DEG_TO_RAD; double area=0; for(uint16_t i=0;i<polygonCount;i++){uint16_t j=(i+1)%polygonCount; double x1=(polygonLog[i].lng-polygonLog[0].lng)*DEG_TO_RAD*cos(lat0)*6371000.0; double y1=(polygonLog[i].lat-polygonLog[0].lat)*DEG_TO_RAD*6371000.0; double x2=(polygonLog[j].lng-polygonLog[0].lng)*DEG_TO_RAD*cos(lat0)*6371000.0; double y2=(polygonLog[j].lat-polygonLog[0].lat)*DEG_TO_RAD*6371000.0; area+=x1*y2-x2*y1;} return fabs(area)*0.5; }

void cameraTiltCorrect(float px,float py,float &northM,float &eastM){
  const float alt=max(0.2f,relativeAltitudeM); const float nx=tanf((px-0.5f)*CAMERA_HFOV_DEG*DEG_TO_RAD); const float ey=tanf((py-0.5f)*CAMERA_VFOV_DEG*DEG_TO_RAD); AttitudeData a; portENTER_CRITICAL(&stateMux);a=attitude;portEXIT_CRITICAL(&stateMux);
  eastM=alt*nx; northM=alt*ey; const float r=a.rollDeg*DEG_TO_RAD,p=a.pitchDeg*DEG_TO_RAD; const float ce=cosf(r),se=sinf(r),cp=cosf(p),sp=sinf(p); const float e=eastM*ce+northM*se*sp; const float n=northM*cp-eastM*se*sp; eastM=e; northM=n;
}
void offsetToGPS(double lat,double lng,float northM,float eastM,double &olat,double &olng){ const double R=6371000.0; olat=lat+(northM/R)*RAD_TO_DEG; olng=lng+(eastM/(R*cos(lat*DEG_TO_RAD)))*RAD_TO_DEG; }

bool isDuplicate(double lat,double lng){ for(uint16_t i=0;i<evidenceCount;i++){EvidenceRecord &e=evidence[i]; if(!e.confirmed)continue; if(millis()-e.timeMs>DUPLICATE_WINDOW_MS)continue; if(distanceMeters(lat,lng,e.estimatedLat,e.estimatedLng)<=DUPLICATE_RADIUS_M)return true;} return false; }
void recordEvidence(float px,float py,bool vis,bool therm,float temp){ GPSData g;AttitudeData a;portENTER_CRITICAL(&stateMux);g=gps;a=attitude;portEXIT_CRITICAL(&stateMux); if(!g.fix)return; float n,e;cameraTiltCorrect(px,py,n,e); double elat,elon;offsetToGPS(g.lat,g.lng,n,e); const bool dup=isDuplicate(elat,elon); duplicateSuppressed=dup; if(evidenceCount<EVIDENCE_MAX){EvidenceRecord &r=evidence[evidenceCount++];r.id=evidenceNextId++;r.timeMs=millis();r.droneLat=g.lat;r.droneLng=g.lng;r.estimatedLat=elat;r.estimatedLng=elon;r.altitudeM=relativeAltitudeM;r.rollDeg=a.rollDeg;r.pitchDeg=a.pitchDeg;r.yawDeg=a.yawDeg;r.pixelX=px;r.pixelY=py;r.temperatureC=temp;r.visible=vis;r.thermal=therm;r.confirmed=(vis&&therm);r.duplicate=dup;} if(!dup && vis&&therm) queueRescueAlert(elat,elon,temp); }

void processMultiframeDetection(bool visible,bool thermal,float px,float py,float temp){
  const uint32_t now=millis(); if(now-detectionTrack.lastMs>MULTIFRAME_WINDOW_MS)detectionTrack.confirmations=0;
  if(visible||thermal)detectionTrack.confirmations++; else detectionTrack.confirmations=0; detectionTrack.lastMs=now;
  if(detectionTrack.confirmations>=MULTIFRAME_REQUIRED){ multimodalConfirmed=visible&&thermal; visualCandidateConfirmed=visible; if(multimodalConfirmed)recordEvidence(px,py,true,true,temp); detectionTrack.confirmations=0; }
}

bool enqueueSMS(const char *msg){uint8_t next=(smsTail+1)%SMS_QUEUE_SIZE;if(next==smsHead)return false;strncpy(smsQueue[smsTail].text,msg,sizeof(smsQueue[smsTail].text)-1);smsQueue[smsTail].text[sizeof(smsQueue[smsTail].text)-1]=0;smsQueue[smsTail].retries=0;smsQueue[smsTail].nextTry=millis();smsQueue[smsTail].used=true;smsTail=next;return true;}
void queueRescueAlert(double lat,double lng,float temp){char msg[300];snprintf(msg,sizeof(msg),"SAR ALERT: candidate confirmed. GPS %.7f,%.7f Temp %.1fC Maps: https://maps.google.com/?q=%.7f,%.7f",lat,lng,temp,lat,lng);enqueueSMS(msg);}
bool sendSMSNow(const char *msg){ sim800.println("AT+CMGF=1");delay(200);sim800.print("AT+CMGS=\"");sim800.print(RESCUE_PHONE);sim800.println("\"");delay(300);sim800.print(msg);sim800.write(26);uint32_t t=millis();while(millis()-t<7000){if(sim800.available()){String r=sim800.readString();if(r.indexOf("+CMGS")>=0||r.indexOf("OK")>=0)return true;}}return false; }
void serviceSMS(){if(millis()-lastSmsServiceMs<1000)return;lastSmsServiceMs=millis();if(smsHead==smsTail)return;if(millis()<smsQueue[smsHead].nextTry)return;if(sendSMSNow(smsQueue[smsHead].text)){smsQueue[smsHead].used=false;smsHead=(smsHead+1)%SMS_QUEUE_SIZE;}else{smsQueue[smsHead].retries++;if(smsQueue[smsHead].retries>=3){smsQueue[smsHead].used=false;smsHead=(smsHead+1)%SMS_QUEUE_SIZE;}else smsQueue[smsHead].nextTry=millis()+5000;}}


void updateAltitudePIDFramework(){
  const float err=desiredAltitudeM-relativeAltitudeM;
  altitudePidOutputUs=altitudePID.update(desiredAltitudeM,relativeAltitudeM,0.1f);
}
void filterGPSData(){
  static bool init=false; static double fl=0,fn=0; GPSData g;portENTER_CRITICAL(&stateMux);g=gps;portEXIT_CRITICAL(&stateMux); if(!g.fix)return; if(!init){fl=g.lat;fn=g.lng;init=true;} else {fl=0.8*fl+0.2*g.lat;fn=0.8*fn+0.2*g.lng;} portENTER_CRITICAL(&stateMux);gps.lat=fl;gps.lng=fn;portEXIT_CRITICAL(&stateMux);
}
void autoLogPolygon(){
  if(mission!=MissionState::SURVEY_GRID || millis()-lastPolygonAutoMs<2000)return; lastPolygonAutoMs=millis(); GPSData g;portENTER_CRITICAL(&stateMux);g=gps;portEXIT_CRITICAL(&stateMux);if(g.fix)addPolygonPoint(g.lat,g.lng);
}

void updateFullSafety(){
  filterGPSData(); updateAltitudePIDFramework(); autoLogPolygon();
  GPSData g;portENTER_CRITICAL(&stateMux);g=gps;portEXIT_CRITICAL(&stateMux); const bool stale=!g.fix || millis()-g.lastFixMs>GPS_STALE_MS; gpsLostFailsafe=stale;
  if(motorsArmed && stale && (mission==MissionState::SURVEY_GRID||mission==MissionState::FLY_TO_WAYPOINT||mission==MissionState::RETURN_HOME)){mission=MissionState::GPS_FAILSAFE_HOLD;}
  if(motorsArmed && criticalBattery){mission=MissionState::EMERGENCY_STOP;disarmMotors("critical battery");}
  if(motorsArmed && lowBattery && homeLocked && mission!=MissionState::RETURN_HOME){mission=MissionState::RETURN_HOME;}
  AttitudeData a;portENTER_CRITICAL(&stateMux);a=attitude;portEXIT_CRITICAL(&stateMux); if(fabsf(a.rollDeg)>EMERGENCY_TILT_DEG||fabsf(a.pitchDeg)>EMERGENCY_TILT_DEG){mission=MissionState::EMERGENCY_STOP;disarmMotors("excessive tilt");}
}
void updateLandingState(){
  if(mission!=MissionState::LANDING)return; desiredRollDeg=0;desiredPitchDeg=0;desiredYawRateDps=0;
  // Bench-safe landing profile: state machine only; physical ESCs remain locked.
  if(commandedThrottleUs>LANDING_MIN_THR_US)commandedThrottleUs=max(LANDING_MIN_THR_US,commandedThrottleUs-LANDING_STEP_US);
  if(relativeAltitudeM<=0.20f){commandedThrottleUs=ESC_MIN_US;disarmMotors("landing state complete");}
}
void exportPolygon(){Serial.printf("POLYGON_COUNT=%u AREA_M2=%.2f\n",polygonCount,polygonAreaM2());for(uint16_t i=0;i<polygonCount;i++)Serial.printf("P,%u,%.7f,%.7f,%lu\n",i,polygonLog[i].lat,polygonLog[i].lng,(unsigned long)polygonLog[i].timeMs);}
void printEvidence(){Serial.printf("EVIDENCE_COUNT=%u\n",evidenceCount);for(uint16_t i=0;i<evidenceCount;i++){EvidenceRecord&e=evidence[i];Serial.printf("E,%lu,%.7f,%.7f,%.7f,%.7f,A%.1f,T%.1f,C%u,D%u\n",(unsigned long)e.id,e.droneLat,e.droneLng,e.estimatedLat,e.estimatedLng,e.altitudeM,e.temperatureC,e.confirmed,e.duplicate);}}

// ========================== FUNCTION DECLARATIONS ===========================

void flightTask(void *parameter);
void cameraTask(void *parameter);
void serviceTask(void *parameter);

bool initializeMPU();
bool calibrateMPU(uint16_t samples = 1200);
bool readMPU(float &ax, float &ay, float &az, float &gx, float &gy, float &gz);
void updateAttitude(float ax, float ay, float az, float gx, float gy, float gz);
void updateVibrationMonitor(float ax, float ay, float az);

