rushikesh81005-dev/autonomous-AI-powered-drone-for-SAR-mission-project-SAR-/SAR_Drone_ESP32_FULL_FEATURE_BENCH_SAFE.ino
void initializeEscOutputs();
void writeEscMicroseconds(uint8_t motor, uint16_t pulseUs);
void writeAllMotorsMinimum();
void runFlightController();
void computeMotorMix(float throttleUs, float rollCorrection,
                     float pitchCorrection, float yawCorrection);
void resetControllers();
bool armMotors();
void disarmMotors(const char *reason);

void parseGPS();
bool parseNMEALine(char *line);
bool validateNMEAChecksum(const char *line);
double nmeaCoordinateToDegrees(const char *field, bool longitude);
double distanceMeters(double lat1, double lon1, double lat2, double lon2);
float bearingDegrees(double lat1, double lon1, double lat2, double lon2);
float wrap180(float angle);
float wrap360(float angle);

void updateMissionLogic();
void updateNavigationSetpoints();
bool configureSurvey(double originLat, double originLng,
                     float sideKm, float spacingKm);
bool surveyWaypoint(uint32_t index, double &lat, double &lng);
void advanceSurveyWaypoint();

bool initializeCamera();
uint8_t frameLuminance(const camera_fb_t *frame, int pixelIndex);
void analyzeCameraFrame(camera_fb_t *frame);
void reportVisualCandidate();

void processSerialCommands();
void printStatus();
void printHelp();
void setupNetworkServices();
void sendTelemetry();
void updateLandingState();
void updateFullBarometer();
void updateFullThermal();
void updateFullBattery();
void updateFullSafety();
void serviceSMS();
void addPolygonPoint(double lat,double lng);
void exportPolygon();
void printEvidence();
void processMultiframeDetection(bool visible,bool thermal,float px,float py,float temp);
bool enqueueSMS(const char *msg);
void queueRescueAlert(double lat,double lng,float temp);

// ================================ SETUP ======================================

void setup() {
  Serial.begin(115200);
  delay(400);
  Serial.println();
  Serial.println("SAR ESP32 direct controller starting...");
  Serial.printf("BENCH_TEST_MODE=%s\n", BENCH_TEST_MODE ? "TRUE" : "FALSE");

  pinMode(MISSION_SWITCH_PIN, INPUT_PULLUP);

  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN, 400000);
  if (!initializeMPU()) {
    Serial.println("FATAL: MPU6050 not detected. Motors remain disabled.");
  } else {
    Serial.println("Keep the aircraft level and completely still: calibrating MPU6050...");
    imuCalibrated = calibrateMPU();
    Serial.println(imuCalibrated ? "MPU6050 calibration complete."
                                 : "MPU6050 calibration failed.");
  }

  Serial2.begin(9600, SERIAL_8N1, GPS_RX_PIN, GPS_TX_PIN);
  initFullSensors();
  initializeEscOutputs();
  writeAllMotorsMinimum();

  if (ENABLE_CAMERA) {
    cameraHealthy = initializeCamera();
    if (cameraHealthy) {
      Serial.println("Camera initialized.");
    } else {
      Serial.println("WARNING: Camera initialization failed; flight core remains available.");
    }
  }

  setupNetworkServices();

  xTaskCreatePinnedToCore(flightTask, "Flight250Hz", 8192, nullptr, 3,
                          &flightTaskHandle, 0);
  if (ENABLE_CAMERA && cameraHealthy) {
    xTaskCreatePinnedToCore(cameraTask, "CameraAnalysis", 8192, nullptr, 1,
                            &cameraTaskHandle, 1);
  }
  xTaskCreatePinnedToCore(serviceTask, "CommandTelemetry", 6144, nullptr, 1,
                          &serviceTaskHandle, 1);

  printHelp();
}

void loop() {
  // FreeRTOS tasks own all runtime work.
  vTaskDelay(pdMS_TO_TICKS(1000));
}

// ============================== FLIGHT TASK ==================================

void flightTask(void *parameter) {
  (void)parameter;
  uint32_t nextWakeUs = micros();

  for (;;) {
    nextWakeUs += CONTROL_PERIOD_US;

    // Runtime calibration is performed only in this task, preventing a second
    // task from using Wire concurrently with the 250 Hz sensor reader.
    if (calibrationRequested && !motorsArmed) {
      calibrationRequested = false;
      imuCalibrated = false;
      imuCalibrated = calibrateMPU();
      Serial.println(imuCalibrated ? "Calibration complete." : "Calibration failed.");
      nextWakeUs = micros();
    }

    float ax, ay, az, gx, gy, gz;
    if (readMPU(ax, ay, az, gx, gy, gz)) {
      imuHealthy = true;
      updateAttitude(ax, ay, az, gx, gy, gz);
      updateVibrationMonitor(ax, ay, az);
    } else {
      imuHealthy = false;
      disarmMotors("IMU read failure");
    }

    parseGPS();
    updateFullBarometer();
    updateFullBattery();
    updateFullSafety();
    updateLandingState();
    updateMissionLogic();
    runFlightController();

    const int32_t remainingUs = (int32_t)(nextWakeUs - micros());
    if (remainingUs > 1000) {
      vTaskDelay(pdMS_TO_TICKS((remainingUs - 500) / 1000));
    }
    while ((int32_t)(nextWakeUs - micros()) > 0) {
      taskYIELD();
    }

    // If computation overruns badly, restart timing instead of chasing backlog.
    if ((int32_t)(micros() - nextWakeUs) > (int32_t)CONTROL_PERIOD_US) {
      nextWakeUs = micros();
    }
  }
}

// =============================== MPU6050 =====================================

bool initializeMPU() {
  Wire.beginTransmission(MPU_ADDR);
  Wire.write(0x75); // WHO_AM_I
  if (Wire.endTransmission(false) != 0) return false;
  if (Wire.requestFrom((int)MPU_ADDR, 1, true) != 1) return false;
  const uint8_t who = Wire.read();
  if (who != 0x68 && who != 0x69) return false;

  // Wake, select gyro PLL clock, configure DLPF and default full-scale ranges.
  const uint8_t registers[][2] = {
    {0x6B, 0x01}, // PWR_MGMT_1
    {0x1A, 0x03}, // DLPF ~44 Hz accel / ~42 Hz gyro
    {0x19, 0x03}, // internal 1 kHz / (1+3) = 250 Hz
    {0x1B, 0x00}, // gyro +/-250 dps
    {0x1C, 0x00}  // accel +/-2 g
  };

  for (const auto &entry : registers) {
    Wire.beginTransmission(MPU_ADDR);
    Wire.write(entry[0]);
    Wire.write(entry[1]);
    if (Wire.endTransmission() != 0) return false;
  }
  delay(100);
  return true;
}

bool calibrateMPU(uint16_t samples) {
  // readMPU() subtracts the existing bias. Clear it so repeated calibration
  // measures a new absolute bias instead of only the residual.
  gyroBiasX = gyroBiasY = gyroBiasZ = 0.0f;
  double sx = 0, sy = 0, sz = 0;
  uint16_t accepted = 0;
  for (uint16_t i = 0; i < samples; ++i) {
    float ax, ay, az, gx, gy, gz;
    if (readMPU(ax, ay, az, gx, gy, gz)) {
      sx += gx;
      sy += gy;
      sz += gz;
      ++accepted;
    }
    delay(2);
  }
  if (accepted < samples * 0.95f) return false;
  gyroBiasX = sx / accepted;
  gyroBiasY = sy / accepted;
  gyroBiasZ = sz / accepted;
  return true;
}

