rushikesh81005-dev/autonomous-AI-powered-drone-for-SAR-mission-project-SAR-/SAR_Drone_ESP32_FULL_FEATURE_BENCH_SAFE.ino
bool readMPU(float &ax, float &ay, float &az,
             float &gx, float &gy, float &gz) {
  Wire.beginTransmission(MPU_ADDR);
  Wire.write(0x3B);
  if (Wire.endTransmission(false) != 0) return false;
  if (Wire.requestFrom((int)MPU_ADDR, 14, true) != 14) return false;

  const int16_t rawAx = (Wire.read() << 8) | Wire.read();
  const int16_t rawAy = (Wire.read() << 8) | Wire.read();
  const int16_t rawAz = (Wire.read() << 8) | Wire.read();
  (void)((Wire.read() << 8) | Wire.read()); // temperature
  const int16_t rawGx = (Wire.read() << 8) | Wire.read();
  const int16_t rawGy = (Wire.read() << 8) | Wire.read();
  const int16_t rawGz = (Wire.read() << 8) | Wire.read();

  ax = ACCEL_X_SIGN * rawAx / 16384.0f;
  ay = ACCEL_Y_SIGN * rawAy / 16384.0f;
  az = ACCEL_Z_SIGN * rawAz / 16384.0f;
  gx = GYRO_X_SIGN * rawGx / 131.0f - gyroBiasX;
  gy = GYRO_Y_SIGN * rawGy / 131.0f - gyroBiasY;
  gz = GYRO_Z_SIGN * rawGz / 131.0f - gyroBiasZ;
  return true;
}

void updateAttitude(float ax, float ay, float az,
                    float gx, float gy, float gz) {
  static bool initialized = false;
  static float roll = 0, pitch = 0, yaw = 0;

  const float accelNorm = sqrtf(ax * ax + ay * ay + az * az);
  const bool accelTrustworthy = accelNorm > 0.75f && accelNorm < 1.25f;
  const float rollAcc = atan2f(ay, az) * RAD_TO_DEG;
  const float pitchAcc = atan2f(-ax, sqrtf(ay * ay + az * az)) * RAD_TO_DEG;

  if (!initialized) {
    roll = rollAcc;
    pitch = pitchAcc;
    yaw = 0.0f;
    initialized = true;
  } else {
    roll += gx * CONTROL_DT;
    pitch += gy * CONTROL_DT;
    yaw = wrap360(yaw + gz * CONTROL_DT);
    if (accelTrustworthy) {
      roll = COMPLEMENTARY_ALPHA * roll + (1.0f - COMPLEMENTARY_ALPHA) * rollAcc;
      pitch = COMPLEMENTARY_ALPHA * pitch + (1.0f - COMPLEMENTARY_ALPHA) * pitchAcc;
    }
  }

  if (yawResetRequested) {
    portENTER_CRITICAL(&stateMux);
    yaw = wrap360(requestedYawDeg);
    yawResetRequested = false;
    portEXIT_CRITICAL(&stateMux);
  }

  GPSData localGps;
  portENTER_CRITICAL(&stateMux);
  localGps = gps;
  portEXIT_CRITICAL(&stateMux);

  // GPS course is meaningful only while translating. Fuse it very slowly.
  if (localGps.courseValid && localGps.speedMps >= GPS_COURSE_MIN_MPS) {
    const float courseError = wrap180(localGps.courseDeg - yaw);
    yaw = wrap360(yaw + 0.02f * courseError);
    headingReferenceSet = true;
  }

  portENTER_CRITICAL(&stateMux);
  attitude.rollDeg = roll;
  attitude.pitchDeg = pitch;
  attitude.yawDeg = yaw;
  attitude.gxDps = gx;
  attitude.gyDps = gy;
  attitude.gzDps = gz;
  portEXIT_CRITICAL(&stateMux);
}

void updateVibrationMonitor(float ax, float ay, float az) {
  // Separate slow airframe motion/gravity from fast vibration, then maintain an
  // exponentially weighted RMS. Thresholds require airframe-specific testing.
  static bool ready = false;
  static float slowAx = 0, slowAy = 0, slowAz = 1;
  static float meanSquare = 0;
  static uint16_t highCount = 0;

  if (!ready) {
    slowAx = ax; slowAy = ay; slowAz = az;
    ready = true;
  }
  constexpr float slowAlpha = 0.02f;
  slowAx += slowAlpha * (ax - slowAx);
  slowAy += slowAlpha * (ay - slowAy);
  slowAz += slowAlpha * (az - slowAz);
  const float hx = ax - slowAx;
  const float hy = ay - slowAy;
  const float hz = az - slowAz;
  const float instantSquare = hx * hx + hy * hy + hz * hz;
  meanSquare = 0.98f * meanSquare + 0.02f * instantSquare;
  vibrationRmsG = sqrtf(meanSquare);

  if (!motorsArmed || commandedThrottleUs < 1200) {
    highCount = 0;
    vibrationAlert = false;
    return;
  }

  if (vibrationRmsG > 0.35f) {
    if (highCount < 1000) ++highCount;
  } else if (vibrationRmsG < 0.20f) {
    highCount = 0;
    vibrationAlert = false;
  }

  if (highCount >= 250 && !vibrationAlert) { // approximately one second
    vibrationAlert = true;
    Serial.printf("VIBRATION ALERT: high-frequency RMS %.3f g\n", vibrationRmsG);
    if (ENABLE_VIBRATION_RTH && homeLocked) mission = MissionState::RETURN_HOME;
  }
}

// =============================== ESC OUTPUT =================================

static uint32_t pulseToDuty(uint16_t pulseUs) {
  const uint32_t maxDuty = (1UL << ESC_PWM_BITS) - 1UL;
  const uint32_t periodUs = 1000000UL / ESC_PWM_HZ;
  return ((uint32_t)pulseUs * maxDuty) / periodUs;
}

void initializeEscOutputs() {
  const int pins[4] = {MOTOR_1_PIN, MOTOR_2_PIN, MOTOR_3_PIN, MOTOR_4_PIN};
  for (uint8_t i = 0; i < 4; ++i) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcAttachChannel(pins[i], ESC_PWM_HZ, ESC_PWM_BITS, MOTOR_CHANNEL[i]);
#else
    ledcSetup(MOTOR_CHANNEL[i], ESC_PWM_HZ, ESC_PWM_BITS);
    ledcAttachPin(pins[i], MOTOR_CHANNEL[i]);
#endif
    writeEscMicroseconds(i, ESC_MIN_US);
  }
  delay(3000); // allow standard PWM ESCs to recognize minimum throttle
}

void writeEscMicroseconds(uint8_t motor, uint16_t pulseUs) {
  if (motor >= 4) return;
  pulseUs = constrain(pulseUs, ESC_MIN_US, ESC_MAX_US);
  const uint32_t duty = pulseToDuty(pulseUs);
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWriteChannel(MOTOR_CHANNEL[motor], duty);
#else
  ledcWrite(MOTOR_CHANNEL[motor], duty);
#endif
}

void writeAllMotorsMinimum() {
  for (uint8_t i = 0; i < 4; ++i) writeEscMicroseconds(i, ESC_MIN_US);
}

void resetControllers() {
  AttitudeData a;
  portENTER_CRITICAL(&stateMux);
  a = attitude;
  portEXIT_CRITICAL(&stateMux);
  rollRatePID.reset(a.gxDps);
  pitchRatePID.reset(a.gyDps);
  yawRatePID.reset(a.gzDps);
}

bool armMotors() {
  if (BENCH_TEST_MODE) {
    Serial.println("BENCH mode: logical arming allowed, physical outputs remain at minimum.");
  }
  if (digitalRead(MISSION_SWITCH_PIN) != LOW) {
    Serial.println("ARM REFUSED: mission/arm switch must be LOW.");
    return false;
  }
  if (!imuHealthy || !imuCalibrated) {
    Serial.println("ARM REFUSED: IMU is not healthy and calibrated.");
    return false;
  }
  AttitudeData a;
  portENTER_CRITICAL(&stateMux);
  a = attitude;
  portEXIT_CRITICAL(&stateMux);
  if (fabsf(a.rollDeg) > 10.0f || fabsf(a.pitchDeg) > 10.0f) {
    Serial.println("ARM REFUSED: aircraft must be level within 10 degrees.");
    return false;
  }
  commandedThrottleUs = ESC_MIN_US;
  resetControllers();
  motorsArmed = true;
  mission = MissionState::STABILIZE;
  Serial.println("LOGIC ARMED. Raise THR gradually only during a controlled test.");
  return true;
}

void disarmMotors(const char *reason) {
  const bool wasArmed = motorsArmed;
  motorsArmed = false;
  mission = MissionState::DISARMED;
  commandedThrottleUs = ESC_MIN_US;
  writeAllMotorsMinimum();
  resetControllers();
  if (wasArmed && reason) Serial.printf("DISARMED: %s\n", reason);
}

