rushikesh81005-dev/autonomous-AI-powered-drone-for-SAR-mission-project-SAR-/SAR_Drone_ESP32_FULL_FEATURE_BENCH_SAFE.ino
#if FOMO_LIBRARY_PRESENT
static int fomoSignalGetData(size_t offset, size_t length, float *out_ptr) {
  if (!fomoFrameForInference || !out_ptr) return -1;
  const int srcW = fomoFrameForInference->width;
  const int srcH = fomoFrameForInference->height;
  // The FOMO model is trained on grayscale 96x96 in the supplied integration
  // contract. Bilinear interpolation is intentionally avoided to keep latency
  // low; nearest-neighbour sampling is deterministic and ESP32 friendly.
  const size_t total = (size_t)FOMO_INPUT_WIDTH * FOMO_INPUT_HEIGHT;
  for (size_t i = 0; i < length; ++i) {
    const size_t idx = offset + i;
    if (idx >= total) { out_ptr[i] = 0; continue; }
    const int ox = (int)(idx % FOMO_INPUT_WIDTH);
    const int oy = (int)(idx / FOMO_INPUT_WIDTH);
    const int sx = min(srcW - 1, (ox * srcW) / FOMO_INPUT_WIDTH);
    const int sy = min(srcH - 1, (oy * srcH) / FOMO_INPUT_HEIGHT);
    out_ptr[i] = (float)frameLuminance(fomoFrameForInference, sy * srcW + sx);
  }
  return 0;
}

bool runFomoPersonDetector(camera_fb_t *frame, float &cx, float &cy, float &confidence) {
  if (!frame || frame->width != 160 || frame->height != 120) return false;
  const uint32_t t0 = millis();
  fomoFrameForInference = frame;
  signal_t signal;
  signal.total_length = (size_t)FOMO_INPUT_WIDTH * FOMO_INPUT_HEIGHT;
  signal.get_data = fomoSignalGetData;

  ei_impulse_result_t result = {};
  EI_IMPULSE_ERROR err = run_classifier(&signal, &result, false);
  fomoFrameForInference = nullptr;
  fomoInferenceMs = millis() - t0;
  ++fomoInferenceCount;
  if (err != EI_IMPULSE_OK) {
    fomoHealthy = false;
    return false;
  }
  fomoHealthy = true;

  bool person = false;
  float best = 0.0f;
  float bestCx = 0.5f, bestCy = 0.5f;
  // FOMO exports object detections as bounding_boxes. The object label used by
  // the training dataset must be exactly "person" (case-insensitive).
  for (size_t i = 0; i < EI_CLASSIFIER_OBJECT_DETECTION_COUNT; ++i) {
    const auto &bb = result.bounding_boxes[i];
    if (bb.value <= 0.0f || bb.label == nullptr) continue;
    bool isPerson = strcasecmp(bb.label, "person") == 0 ||
                    strcasecmp(bb.label, "human") == 0 ||
                    strcasecmp(bb.label, "survivor") == 0;
    if (isPerson && bb.value > best) {
      best = bb.value;
      bestCx = ((float)bb.x + 0.5f * (float)bb.width) / (float)FOMO_INPUT_WIDTH;
      bestCy = ((float)bb.y + 0.5f * (float)bb.height) / (float)FOMO_INPUT_HEIGHT;
      person = true;
    }
  }
  confidence = best;
  cx = constrain(bestCx, 0.0f, 1.0f);
  cy = constrain(bestCy, 0.0f, 1.0f);
  fomoConfidence = best;
  fomoPersonCandidate = person && best >= FOMO_MIN_CONFIDENCE;
  fomoCenterX = cx;
  fomoCenterY = cy;
  return fomoPersonCandidate;
}
#else
bool runFomoPersonDetector(camera_fb_t *frame, float &cx, float &cy, float &confidence) {
  (void)frame; cx = 0.5f; cy = 0.5f; confidence = 0.0f;
  fomoHealthy = false; fomoPersonCandidate = false;
  return false;
}
#endif

void analyzeCameraFrame(camera_fb_t *frame) {
  // Lightweight background-difference candidate detector. It deliberately
  // does not claim identity, range, or thermal detection.
  static uint8_t background[160 * 120];
  static bool backgroundReady = false;
  static uint8_t candidatePersistence = 0;
  static uint32_t lastReportMs = 0;
  static long previousDarkCount = 0;
  static int previousCenterX = 80;
  static int previousCenterY = 60;

  float fomoCx = 0.5f, fomoCy = 0.5f, fomoConf = 0.0f;
  const bool fomoCandidate = ENABLE_FOMO_TINYML && runFomoPersonDetector(frame, fomoCx, fomoCy, fomoConf);

  if (!backgroundReady) {
    for (int i = 0; i < 160 * 120; ++i) {
      background[i] = frameLuminance(frame, i);
    }
    backgroundReady = true;
    return;
  }

  int minX = 159, maxX = 0, minY = 119, maxY = 0;
  uint32_t changed = 0;
  uint32_t darkCount = 0;
  uint32_t sumDarkX = 0, sumDarkY = 0;

  for (int y = 0; y < 120; y += 2) {
    for (int x = 0; x < 160; x += 2) {
      const int index = y * 160 + x;
      const uint8_t pixel = frameLuminance(frame, index);
      const uint8_t bg = background[index];
      if (abs((int)pixel - (int)bg) > 35) {
        ++changed;
        minX = min(minX, x); maxX = max(maxX, x);
        minY = min(minY, y); maxY = max(maxY, y);
      }
      if (pixel < 55) {
        ++darkCount;
        sumDarkX += x;
        sumDarkY += y;
      }
      // Slow IIR background adaptation: 31/32 old + 1/32 new.
      background[index] = (uint8_t)(((uint16_t)bg * 31U + pixel) >> 5);
    }
  }

  bool candidate = false;
  if (changed >= 70 && changed <= 1400 && maxX > minX && maxY > minY) {
    const float width = maxX - minX + 1;
    const float height = maxY - minY + 1;
    const float aspect = height / width;
    const float sampledBoxArea = (width * height) / 4.0f;
    const float fill = changed / max(1.0f, sampledBoxArea);
    candidate = aspect >= 1.15f && aspect <= 4.5f &&
                fill >= 0.12f && fill <= 0.90f;
  }

  candidatePersistence = candidate ? min(20, candidatePersistence + 1)
                                   : max(0, candidatePersistence - 1);
  if (candidatePersistence >= 6 && millis() - lastReportMs > 15000) {
    visualCandidateConfirmed = true;
    reportVisualCandidate();
    lastReportMs = millis();
    candidatePersistence = 0;
  }

  if (ENABLE_GESTURE_COMMANDS && darkCount > 300) {
    const int centerX = sumDarkX / darkCount;
    const int centerY = sumDarkY / darkCount;
    const int dx = centerX - previousCenterX;
    const int dy = centerY - previousCenterY;
    const long dArea = (long)darkCount - previousDarkCount;

    if (darkCount > 850 && abs(dx) < 8 && abs(dy) < 8) {
      obstacleBrakeRequested = true;
    } else if (dx < -20) {
      obstacleBrakeRequested = false;
      if (mission == MissionState::OBSTACLE_BRAKE)
        mission = MissionState::STABILIZE;
    } else if (dx > 20) {
      if (homeLocked) mission = MissionState::RETURN_HOME;
    }

    (void)dArea; // retained for future near/far gesture validation
    previousCenterX = centerX;
    previousCenterY = centerY;
    previousDarkCount = darkCount;
  } else if (darkCount <= 300) {
    previousDarkCount = 0;
  }

