rushikesh81005-dev/autonomous-AI-powered-drone-for-SAR-mission-project-SAR-/SAR_Drone_ESP32_FULL_FEATURE_BENCH_SAFE.ino
  const bool legacyVisibleCandidate = candidate || darkCount > 300;
  const bool visibleCandidate = fomoCandidate || legacyVisibleCandidate;
  // Prefer the neural-network centroid whenever FOMO produces a person.
  const float legacyPx = (darkCount > 0) ? ((float)(sumDarkX / max(1UL, darkCount)) / (float)frame->width) : 0.5f;
  const float legacyPy = (darkCount > 0) ? ((float)(sumDarkY / max(1UL, darkCount)) / (float)frame->height) : 0.5f;
  const float px = fomoCandidate ? fomoCx : legacyPx;
  const float py = fomoCandidate ? fomoCy : legacyPy;
  processMultiframeDetection(visibleCandidate, thermalHotspot, px, py, thermalMaxC);
}

void reportVisualCandidate() {
  GPSData g;
  portENTER_CRITICAL(&stateMux);
  g = gps;
  portEXIT_CRITICAL(&stateMux);
  Serial.println("VISUAL CANDIDATE: persistent person-like moving region detected.");
  if (g.fix) {
    Serial.printf("Drone GPS at observation: %.7f, %.7f (not survivor range-fix)\n",
                  g.lat, g.lng);
    if (ENABLE_UDP_TELEMETRY && udpServiceReady &&
        WiFi.status() == WL_CONNECTED) {
      char alert[160];
      snprintf(alert, sizeof(alert),
               "ALERT=VISUAL_CANDIDATE,LAT=%.7f,LON=%.7f,"
               "COORDINATE_TYPE=DRONE_OBSERVATION",
               g.lat, g.lng);
      telemetryUdp.beginPacket(BASE_IP, TELEMETRY_PORT);
      telemetryUdp.print(alert);
      telemetryUdp.endPacket();
    }
  } else {
    Serial.println("No current GPS fix available for this observation.");
  }
  sendTelemetry();
}

// ========================== COMMANDS / TELEMETRY ============================

void serviceTask(void *parameter) {
  (void)parameter;
  uint32_t lastTelemetryMs = 0;
  for (;;) {
    processSerialCommands();
    updateFullThermal();
    serviceSMS();
    if (WiFi.status() == WL_CONNECTED) {
      if (ENABLE_WIFI_OTA && !otaServiceReady) {
        ArduinoOTA.begin();
        otaServiceReady = true;
        Serial.println("OTA service ready while disarmed.");
      }
      if (ENABLE_UDP_TELEMETRY && !udpServiceReady) {
        telemetryUdp.begin(TELEMETRY_PORT);
        udpServiceReady = true;
      }
      // Do not even service an update request while motors are logically armed.
      if (ENABLE_WIFI_OTA && otaServiceReady && !motorsArmed) ArduinoOTA.handle();
    }
    if (millis() - lastTelemetryMs >= 1000) {
      sendTelemetry();
      lastTelemetryMs = millis();
    }
    vTaskDelay(pdMS_TO_TICKS(10));
  }
}

void setupNetworkServices() {
  if (!ENABLE_WIFI_OTA && !ENABLE_UDP_TELEMETRY) return;
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  if (ENABLE_WIFI_OTA) {
    ArduinoOTA.setHostname("sar-esp32-drone");
    ArduinoOTA.setPassword(OTA_PASSWORD);
    ArduinoOTA.onStart([]() {
      disarmMotors("OTA update requested");
      Serial.println("OTA update starting; motors locked.");
    });
    ArduinoOTA.onEnd([]() { Serial.println("OTA update complete."); });
  }
}

const char *missionName(MissionState state) {
  switch (state) {
    case MissionState::DISARMED: return "DISARMED";
    case MissionState::STABILIZE: return "STABILIZE";
    case MissionState::FLY_TO_WAYPOINT: return "WAYPOINT";
    case MissionState::RETURN_HOME: return "RTH";
    case MissionState::OBSTACLE_BRAKE: return "BRAKE";
    case MissionState::SURVEY_GRID: return "SURVEY";
    case MissionState::GPS_FAILSAFE_HOLD: return "GPS_FAILSAFE";
    case MissionState::EMERGENCY_STOP: return "EMERGENCY";
    case MissionState::LANDING: return "LANDING";
  }
  return "UNKNOWN";
}

void sendTelemetry() {
  GPSData g;
  AttitudeData a;
  portENTER_CRITICAL(&stateMux);
  g = gps;
  a = attitude;
  portEXIT_CRITICAL(&stateMux);

  char packet[300];
  snprintf(packet, sizeof(packet),
           "STATE=%s,ARM=%u,BENCH=%u,R=%.2f,P=%.2f,Y=%.2f,"
           "GPS=%u,SAT=%u,LAT=%.7f,LON=%.7f,SPD=%.2f,THR=%.0f,"
           "M=%u/%u/%u/%u,CANDIDATE=%u,VIB_RMS=%.3f,VIB_ALERT=%u,BARO_M=%.2f,BAT_V=%.2f,LOWBAT=%u,CRITBAT=%u,THERM_MAX=%.1f,HOTP=%u,CONF=%u,DUP=%u,GPSLOSS=%u,EVID=%u,POLY=%u,ALT_PID=%.1f",
           missionName(mission), motorsArmed, BENCH_TEST_MODE,
           a.rollDeg, a.pitchDeg, a.yawDeg,
           g.fix, g.satellites, g.lat, g.lng, g.speedMps,
           commandedThrottleUs,
           computedMotorUs[0], computedMotorUs[1],
           computedMotorUs[2], computedMotorUs[3],
           visualCandidateConfirmed, vibrationRmsG, vibrationAlert, relativeAltitudeM,batteryVoltage,lowBattery,criticalBattery,thermalMaxC,thermalHotPixels,multimodalConfirmed,duplicateSuppressed,gpsLostFailsafe,evidenceCount,polygonCount,altitudePidOutputUs);

  if (ENABLE_UDP_TELEMETRY && udpServiceReady &&
      WiFi.status() == WL_CONNECTED) {
    telemetryUdp.beginPacket(BASE_IP, TELEMETRY_PORT);
    telemetryUdp.print(packet);
    telemetryUdp.endPacket();
  }
}

void printStatus() {
  GPSData g;
  AttitudeData a;
  double hLat, hLng;
  bool hasHome;
  portENTER_CRITICAL(&stateMux);
  g = gps;
  a = attitude;
  hLat = homeLat;
  hLng = homeLng;
  hasHome = homeLocked;
  portEXIT_CRITICAL(&stateMux);

  Serial.println("---------------- STATUS ----------------");
  Serial.printf("State: %s | logical arm: %s | bench lock: %s\n",
                missionName(mission), motorsArmed ? "YES" : "NO",
                BENCH_TEST_MODE ? "ON" : "OFF");
  Serial.printf("IMU: healthy=%u calibrated=%u | R/P/Y: %.2f %.2f %.2f deg\n",
                imuHealthy, imuCalibrated, a.rollDeg, a.pitchDeg, a.yawDeg);
  Serial.printf("Rates: %.2f %.2f %.2f dps | desired: %.2f %.2f yawRate %.2f\n",
                a.gxDps, a.gyDps, a.gzDps,
                desiredRollDeg, desiredPitchDeg, desiredYawRateDps);
  Serial.printf("GPS: fix=%u satellites=%u lat=%.7f lng=%.7f speed=%.2f m/s\n",
                g.fix, g.satellites, g.lat, g.lng, g.speedMps);
  Serial.printf("Home: %s %.7f %.7f | Heading reference: %s\n",
                hasHome ? "LOCKED" : "NOT LOCKED", hLat, hLng,
                headingReferenceSet ? "SET" : "NOT SET");
  Serial.printf("Throttle: %.0f | computed motors: %u %u %u %u\n",
                commandedThrottleUs, computedMotorUs[0], computedMotorUs[1],
                computedMotorUs[2], computedMotorUs[3]);
  Serial.printf("Vibration RMS: %.3f g | alert: %s | automatic RTH: %s\n",
                vibrationRmsG, vibrationAlert ? "YES" : "NO",
                ENABLE_VIBRATION_RTH ? "ENABLED" : "DISABLED");
  Serial.printf("Baro altitude: %.2f m | vertical rate: %.2f m/s | BMP=%u | AltPID=%.1f us\n",relativeAltitudeM,verticalRateMps,fullBmpHealthy,altitudePidOutputUs);
  Serial.printf("Battery: %.2f V healthy=%u low=%u critical=%u\n",batteryVoltage,batteryHealthy,lowBattery,criticalBattery);
  Serial.printf("Thermal: max=%.1fC avg=%.1fC hotPixels=%u hotspot=%u confirmed=%u\n",thermalMaxC,thermalAverageC,thermalHotPixels,thermalHotspot,multimodalConfirmed);
  Serial.printf("FOMO: library=%u healthy=%u person=%u conf=%.2f center=(%.2f,%.2f) infer_ms=%lu count=%lu\n", FOMO_LIBRARY_PRESENT, fomoHealthy, fomoPersonCandidate, fomoConfidence, fomoCenterX, fomoCenterY, (unsigned long)fomoInferenceMs, (unsigned long)fomoInferenceCount);
  Serial.printf("Evidence=%u Polygon=%u Area=%.2f m2 SMS=%u\n",evidenceCount,polygonCount,polygonAreaM2(),(smsTail+SMS_QUEUE_SIZE-smsHead)%SMS_QUEUE_SIZE);
  Serial.println("----------------------------------------");
}

void printHelp() {
  Serial.println("Commands (newline terminated):");
  Serial.println("  STATUS");
  Serial.println("  ARM 7319       - requires physical switch LOW; bench lock remains active");
  Serial.println("  DISARM");
  Serial.println("  CALIBRATE      - disarmed, level and completely still");
  Serial.println("  THR 1000..1750 - open-loop throttle; there is no altitude hold");
  Serial.println("  YAW degrees    - manually establish north-referenced yaw");
  Serial.println("  WP lat lon     - set a waypoint");
  Serial.println("  STARTWP        - start waypoint mission after logical arm");
  Serial.println("  SURVEY lat lon side_km spacing_km");
  Serial.println("  STARTSURVEY");
  Serial.println("  RTH | BRAKE | RESUME | LAND");
  Serial.println("  POLY lat lon | POLYSHOW | EVIDENCE");
  Serial.println("  SMS text - queue rescue SMS");
  Serial.println("  PIDR kp ki kd | PIDP kp ki kd | PIDY kp ki kd | PIDA kp ki kd");
  Serial.println("  HELP");
}

void processSerialCommands() {
  static char buffer[128];
  static uint8_t length = 0;
  while (Serial.available()) {
    const char c = (char)Serial.read();
    if (c == '\n' || c == '\r') {
      if (length == 0) continue;
      buffer[length] = '\0';
      length = 0;

