rushikesh81005-dev/autonomous-AI-powered-drone-for-SAR-mission-project-SAR-/SAR_Drone_ESP32_FULL_FEATURE_BENCH_SAFE.ino
      if (!strcmp(buffer, "STATUS")) {
        printStatus();
      } else if (!strcmp(buffer, "HELP")) {
        printHelp();
      } else if (!strcmp(buffer, "DISARM")) {
        disarmMotors("operator command");
      } else if (!strcmp(buffer, "ARM 7319")) {
        armMotors();
      } else if (!strcmp(buffer, "CALIBRATE")) {
        if (motorsArmed) Serial.println("Calibration refused while armed.");
        else {
          calibrationRequested = true;
          Serial.println("Calibration requested; keep aircraft level and still.");
        }
      } else if (!strcmp(buffer, "RTH")) {
        if (motorsArmed && homeLocked) mission = MissionState::RETURN_HOME;
        else Serial.println("RTH refused: logical arm and home lock required.");
      } else if (!strcmp(buffer, "BRAKE")) {
        obstacleBrakeRequested = true;
        mission = MissionState::OBSTACLE_BRAKE;
      } else if (!strcmp(buffer, "LAND")) {
        if(motorsArmed) { mission=MissionState::LANDING; landingRequested=true; Serial.println("Landing state requested (bench-safe; ESC lock remains active)."); } else Serial.println("LAND refused: not logically armed.");
      } else if (!strcmp(buffer, "POLYSHOW")) {
        exportPolygon();
      } else if (!strcmp(buffer, "EVIDENCE")) {
        printEvidence();
      } else if (!strncmp(buffer,"POLY ",5)) {
        double la,lo; if(sscanf(buffer,"POLY %lf %lf",&la,&lo)==2 && la>=-90&&la<=90&&lo>=-180&&lo<=180){addPolygonPoint(la,lo);Serial.printf("Polygon point %u added.\n",polygonCount);} else Serial.println("Invalid polygon point.");
      } else if (!strncmp(buffer,"SMS ",4)) {
        if(enqueueSMS(buffer+4)) Serial.println("SMS queued."); else Serial.println("SMS queue full.");
      } else if (!strcmp(buffer, "RESUME")) {
        obstacleBrakeRequested = false;
        mission = motorsArmed ? MissionState::STABILIZE : MissionState::DISARMED;
      } else if (!strcmp(buffer, "STARTWP")) {
        GPSData g;
        portENTER_CRITICAL(&stateMux); g = gps; portEXIT_CRITICAL(&stateMux);
        if (motorsArmed && targetValid && g.fix && headingReferenceSet)
          mission = MissionState::FLY_TO_WAYPOINT;
        else
          Serial.println("STARTWP refused: arm, target, GPS and heading reference required.");
      } else if (!strcmp(buffer, "STARTSURVEY")) {
        GPSData g;
        portENTER_CRITICAL(&stateMux); g = gps; portEXIT_CRITICAL(&stateMux);
        if (motorsArmed && survey.valid && g.fix && headingReferenceSet)
          mission = MissionState::SURVEY_GRID;
        else
          Serial.println("STARTSURVEY refused: arm, survey, GPS and heading reference required.");
      } else {
        float value;
        double lat, lng;
        float sideKm, spacingKm;
        float kp, ki, kd;
        if (sscanf(buffer, "THR %f", &value) == 1) {
          commandedThrottleUs = constrain(value, (float)ESC_MIN_US,
                                          (float)THROTTLE_MAX_US);
          Serial.printf("Open-loop throttle set to %.0f us.\n", commandedThrottleUs);
        } else if (sscanf(buffer, "YAW %f", &value) == 1) {
          if (motorsArmed) {
            Serial.println("YAW reset refused while armed.");
          } else {
            portENTER_CRITICAL(&stateMux);
            requestedYawDeg = wrap360(value);
            yawResetRequested = true;
            portEXIT_CRITICAL(&stateMux);
            headingReferenceSet = true;
            Serial.printf("Yaw reference set to %.1f degrees.\n", wrap360(value));
          }
        } else if (sscanf(buffer, "WP %lf %lf", &lat, &lng) == 2) {
          if (lat >= -90 && lat <= 90 && lng >= -180 && lng <= 180) {
            portENTER_CRITICAL(&stateMux);
            targetLat = lat;
            targetLng = lng;
            targetValid = true;
            portEXIT_CRITICAL(&stateMux);
            Serial.printf("Waypoint set: %.7f, %.7f\n", lat, lng);
          } else Serial.println("Invalid waypoint coordinates.");
        } else if (sscanf(buffer, "SURVEY %lf %lf %f %f",
                          &lat, &lng, &sideKm, &spacingKm) == 4) {
          if (motorsArmed) {
            Serial.println("Survey reconfiguration refused while armed.");
          } else if (configureSurvey(lat, lng, sideKm, spacingKm))
            Serial.printf("Survey configured: %lu waypoints.\n",
                          (unsigned long)survey.waypointCount);
          else Serial.println("Invalid survey parameters.");
        } else if (sscanf(buffer, "PIDR %f %f %f", &kp, &ki, &kd) == 3) {
          if (motorsArmed || kp < 0 || ki < 0 || kd < 0)
            Serial.println("PID update refused: disarm and use non-negative gains.");
          else {
            rollRatePID.kp = kp; rollRatePID.ki = ki; rollRatePID.kd = kd;
            rollRatePID.reset(); Serial.println("Roll-rate PID updated.");
          }
        } else if (sscanf(buffer, "PIDP %f %f %f", &kp, &ki, &kd) == 3) {
          if (motorsArmed || kp < 0 || ki < 0 || kd < 0)
            Serial.println("PID update refused: disarm and use non-negative gains.");
          else {
            pitchRatePID.kp = kp; pitchRatePID.ki = ki; pitchRatePID.kd = kd;
            pitchRatePID.reset(); Serial.println("Pitch-rate PID updated.");
          }
        } else if (sscanf(buffer, "PIDY %f %f %f", &kp, &ki, &kd) == 3) {
          if (motorsArmed || kp < 0 || ki < 0 || kd < 0)
            Serial.println("PID update refused: disarm and use non-negative gains.");
          else {
            yawRatePID.kp = kp; yawRatePID.ki = ki; yawRatePID.kd = kd;
            yawRatePID.reset(); Serial.println("Yaw-rate PID updated.");
          }
        } else if (sscanf(buffer, "PIDA %f %f %f", &kp, &ki, &kd) == 3) {
          if (motorsArmed || kp < 0 || ki < 0 || kd < 0) Serial.println("Altitude PID update refused: disarm and use non-negative gains.");
          else { altitudePID.kp=kp; altitudePID.ki=ki; altitudePID.kd=kd; altitudePID.reset(relativeAltitudeM); Serial.println("Altitude PID framework updated."); }
        } else {
          Serial.println("Unknown command. Enter HELP.");
        }
      }
    } else if (length < sizeof(buffer) - 1) {
      buffer[length++] = (char)toupper((unsigned char)c);
    } else {
      length = 0;
    }
  }
}

