rushikesh81005-dev/autonomous-AI-powered-drone-for-SAR-mission-project-SAR-/SAR_Drone_ESP32_FULL_FEATURE_BENCH_SAFE.ino
/*
// ============================================================================
// OPTIONAL ADD-ON CODE: BMP280 + MLX90640 + SX127x LORA
// ============================================================================
// This entire block is intentionally disabled. Remove only this opening and
// closing block-comment marker after the hardware is wired, pins are assigned,
// required libraries are installed, and bench testing is complete.
//
// Required Arduino libraries:
//   - Adafruit BMP280 Library
//   - Adafruit MLX90640
//   - RadioLib
//
// Safety: Do not enable autonomous takeoff or landing from a BMP280 alone.
// A downward range sensor, battery monitor, physical arm switch, manual
// emergency stop, and fully validated control loops are mandatory. This
// extension therefore leaves automatic takeoff/landing disabled.

#include <Adafruit_BMP280.h>
#include <Adafruit_MLX90640.h>
#include <RadioLib.h>

// ------------------------- FEATURE SWITCHES ---------------------------------
static constexpr bool ENABLE_BMP280_ALTITUDE     = false;
static constexpr bool ENABLE_MLX90640_THERMAL    = false;
static constexpr bool ENABLE_SX127X_FALLBACK     = false;
static constexpr bool ENABLE_TRACK_LOG           = false;
static constexpr bool ENABLE_AUTO_TAKEOFF_LAND   = false; // Must remain false

// ----------------------------- I2C SENSORS ----------------------------------
// BMP280 and MLX90640 share GPIO 21/22 with the MPU6050. Before enabling,
// protect every Wire access in readMPU() and these functions with one mutex.
static constexpr uint8_t BMP280_ADDR_PRIMARY     = 0x76;
static constexpr uint8_t BMP280_ADDR_ALTERNATE   = 0x77;
static constexpr uint8_t MLX90640_ADDR           = 0x33;
static constexpr uint32_t ADDON_SENSOR_PERIOD_MS = 500; // 2 Hz maximum
static constexpr float THERMAL_DELTA_C            = 8.0f;
static constexpr uint16_t THERMAL_MIN_HOT_PIXELS = 4;

Adafruit_BMP280 bmp280;
Adafruit_MLX90640 mlx90640;
SemaphoreHandle_t sharedI2cMutex = nullptr;

volatile bool bmp280Healthy = false;
volatile bool mlx90640Healthy = false;
volatile bool thermalCandidate = false;
volatile float baroAltitudeM = 0.0f;
float groundPressurePa = 0.0f;

// ------------------------------- SX127x -------------------------------------
// Replace every -1 with a physically wired, electrically validated GPIO.
// The current camera/ESC/GPS pin map does not provide a safe default SPI map.
// Do not use ESP32 boot-strapping pins 0, 2, or 12 without hardware validation.
static constexpr int LORA_SCK_PIN  = -1;
static constexpr int LORA_MISO_PIN = -1;
static constexpr int LORA_MOSI_PIN = -1;
static constexpr int LORA_NSS_PIN  = -1;
static constexpr int LORA_RST_PIN  = -1;
static constexpr int LORA_DIO0_PIN = -1;
static constexpr int LORA_DIO1_PIN = -1; // Optional; module dependent

// Set the frequency only to the band authorised for your radio and location.
static constexpr float LORA_FREQUENCY_MHZ = 0.0f;
static constexpr float LORA_BANDWIDTH_KHZ = 125.0f;
static constexpr uint8_t LORA_SPREADING_FACTOR = 9;
static constexpr uint8_t LORA_CODING_RATE = 7;
static constexpr int8_t LORA_TX_POWER_DBM = 10;

// Use SX1278 for common 433 MHz boards; use SX1276 for common 868/915 MHz
// boards. Select exactly one line after identifying the actual radio chip.
//#define USE_SX1278
#if defined(USE_SX1278)
SX1278 lora = new Module(LORA_NSS_PIN, LORA_DIO0_PIN, LORA_RST_PIN,
                         LORA_DIO1_PIN);
#else
SX1276 lora = new Module(LORA_NSS_PIN, LORA_DIO0_PIN, LORA_RST_PIN,
                         LORA_DIO1_PIN);
#endif

volatile bool loraHealthy = false;

// --------------------------- FLIGHT-TRACK LOG ------------------------------
struct TrackPoint {
  double lat;
  double lng;
  uint32_t timeMs;
};

static constexpr uint8_t TRACK_LOG_SIZE = 120;
TrackPoint trackLog[TRACK_LOG_SIZE];
uint8_t trackWriteIndex = 0;
uint8_t trackCount = 0;

bool lockSharedI2c(TickType_t waitTicks = pdMS_TO_TICKS(20)) {
  return sharedI2cMutex &&
         xSemaphoreTake(sharedI2cMutex, waitTicks) == pdTRUE;
}

void unlockSharedI2c() {
  if (sharedI2cMutex) xSemaphoreGive(sharedI2cMutex);
}

bool initializeAddOnHardware() {
  sharedI2cMutex = xSemaphoreCreateMutex();
  if (!sharedI2cMutex) return false;

  if (ENABLE_BMP280_ALTITUDE) {
    if (!lockSharedI2c()) return false;
    bmp280Healthy = bmp280.begin(BMP280_ADDR_PRIMARY, &Wire) ||
                    bmp280.begin(BMP280_ADDR_ALTERNATE, &Wire);
    if (bmp280Healthy) {
      groundPressurePa = bmp280.readPressure();
    }
    unlockSharedI2c();
  }

  if (ENABLE_MLX90640_THERMAL) {
    if (!lockSharedI2c()) return false;
    mlx90640Healthy = mlx90640.begin(MLX90640_ADDR, &Wire);
    if (mlx90640Healthy) {
      mlx90640.setMode(MLX90640_CHESS);
      mlx90640.setResolution(MLX90640_ADC_18BIT);
      mlx90640.setRefreshRate(MLX90640_2_HZ);
    }
    unlockSharedI2c();
  }

  if (ENABLE_SX127X_FALLBACK) {
    if (LORA_SCK_PIN < 0 || LORA_MISO_PIN < 0 || LORA_MOSI_PIN < 0 ||
        LORA_NSS_PIN < 0 || LORA_RST_PIN < 0 || LORA_DIO0_PIN < 0 ||
        LORA_FREQUENCY_MHZ <= 0.0f) {
      Serial.println("LoRa disabled: configure validated pins and frequency.");
      return false;
    }
    SPI.begin(LORA_SCK_PIN, LORA_MISO_PIN, LORA_MOSI_PIN, LORA_NSS_PIN);
    const int radioState = lora.begin(LORA_FREQUENCY_MHZ,
                                      LORA_BANDWIDTH_KHZ,
                                      LORA_SPREADING_FACTOR,
                                      LORA_CODING_RATE,
                                      0x12, LORA_TX_POWER_DBM);
    loraHealthy = (radioState == RADIOLIB_ERR_NONE);
  }
  return bmp280Healthy || mlx90640Healthy || loraHealthy;
}

void updateAddOnSensors() {
  static uint32_t lastRunMs = 0;
  if (millis() - lastRunMs < ADDON_SENSOR_PERIOD_MS) return;
  lastRunMs = millis();

  if (ENABLE_BMP280_ALTITUDE && bmp280Healthy && groundPressurePa > 0.0f &&
      lockSharedI2c()) {
    const float pressurePa = bmp280.readPressure();
    if (pressurePa > 1000.0f) {
      baroAltitudeM = 44330.0f *
          (1.0f - powf(pressurePa / groundPressurePa, 0.19029495f));
    }
    unlockSharedI2c();
  }

  if (ENABLE_MLX90640_THERMAL && mlx90640Healthy && lockSharedI2c()) {
    float thermalFrame[32 * 24];
    const int frameStatus = mlx90640.getFrame(thermalFrame);
    unlockSharedI2c();
    if (frameStatus != 0) return;

    float averageC = 0.0f;
    for (float pixelC : thermalFrame) averageC += pixelC;
    averageC /= (32.0f * 24.0f);

    uint16_t hotPixels = 0;
    for (float pixelC : thermalFrame) {
      if (pixelC >= averageC + THERMAL_DELTA_C) ++hotPixels;
    }
    thermalCandidate = hotPixels >= THERMAL_MIN_HOT_PIXELS;
  }
}

void recordTrackPoint() {
  if (!ENABLE_TRACK_LOG) return;
  GPSData localGps;
  portENTER_CRITICAL(&stateMux);
  localGps = gps;
  portEXIT_CRITICAL(&stateMux);
  if (!localGps.fix) return;

  trackLog[trackWriteIndex] = {localGps.lat, localGps.lng, millis()};
  trackWriteIndex = (trackWriteIndex + 1) % TRACK_LOG_SIZE;
  if (trackCount < TRACK_LOG_SIZE) ++trackCount;
}

bool sendLoRaFallbackTelemetry() {
  const bool wifiTelemetryAvailable = ENABLE_UDP_TELEMETRY &&
                                      udpServiceReady &&
                                      WiFi.status() == WL_CONNECTED;
  if (!ENABLE_SX127X_FALLBACK || !loraHealthy || wifiTelemetryAvailable)
    return false;

  GPSData localGps;
  AttitudeData localAttitude;
  portENTER_CRITICAL(&stateMux);
  localGps = gps;
  localAttitude = attitude;
  portEXIT_CRITICAL(&stateMux);

  char payload[190];
  snprintf(payload, sizeof(payload),
           "S=%s,G=%u,LA=%.6f,LO=%.6f,A=%.1f,T=%u,TH=%u,BA=%.1f",
           missionName(mission), localGps.fix, localGps.lat, localGps.lng,
           baroAltitudeM, thermalCandidate, loraHealthy, vibrationRmsG);
  return lora.transmit(payload) == RADIOLIB_ERR_NONE;
}

// Call updateAddOnSensors() and recordTrackPoint() from serviceTask() only
// after protecting every existing MPU6050 Wire transaction with sharedI2cMutex.
//
// Call initializeAddOnHardware() from setup() after Wire.begin().
//
// Call sendLoRaFallbackTelemetry() from sendTelemetry() after the Wi-Fi UDP
// attempt. LoRa is a low-bandwidth telemetry fallback; it is not a substitute
// for the physical arm switch, local serial control, or emergency disarm.
//
// Do not implement automatic takeoff or landing until a downward range sensor
// and a battery monitor are installed and validated. A BMP280 alone is not
// sufficient for reliable ground detection or a safe landing decision.
// ============================================================================
*/
